module XrcsA3 (exercise_3) where

import Data.Algebra.Helpers

exercise_3 :: IO ()
exercise_3 = do
  -- \| ΕΚΦΩΝΗΣΗ
  prepareText $
    "3. Μια οικογένεια από την Αθήνα αποφασίζει να κάνει τις επόμενες διακοπές της στην Κύπρο ή στη Μακεδονία. Στην Κύπρο μπορεί να πάει με αεροπλάνο ή με πλοίο. Στη Μακεδονία μπορεί να πάει με το αυτοκίνητό της, με τρένο ή με αεροπλάνο. Αν ως αποτέλεσμα του πειράματος θεωρήσουμε τον τόπο διακοπών και το ταξιδιωτικό μέσο, τότε:\n  i) Να γράψετε το δειγματικό χώρο Ω του πειράματος.\n ii) Να βρείτε το ενδεχόμενο Α: \"Η οικογένεια θα πάει με αεροπλάνο στον τόπο των διακοπών της\"."

  -- \| ΔΕΔΟΜΕΝΑ
  -- οι πιθανές εκβάσεις είναι Κ(υπρος) με Α(εροπλάνο) ή Π(λοίο) ,  και M(ακεδονία) με Α, Τ(ρένο) ή C(ar)
  -- για το αυτοκίνητο
  let _W1 = cartesianProduct ['Κ'] ['Α', 'Π']
  let _W2 = cartesianProduct ['Μ'] ['Α', 'Τ', 'C']
  let _W = _W1 ++ _W2

  -- ii Η οικογένεια θα πάει με αεροπλάνο στον τόπο των διακοπών της
  let _A = filter (\(_, b) -> b == 'Α') _W

  -- iii να είναι ίδιες οι μπάλες
  let _B = filter (\(a, b) -> a == b) _W

  -- \| ΛΥΣΗ
  prepareText $
    "\nΛΥΣΗ\n----\nΟι πιθανές εκβάσεις είναι\n    'K'ύπρος με 'Α'εροπλάνο ή 'Π'λοίο, οπότε  ω1= { Κ } και ω2 = { Α, Π } \n    'M'ακεδονία με 'Α'εροπλάνο, 'Τ'ρένο ή 'C'ar (αυτοκίνητο), οπότε ω3 = { Μ } και ω4 ={ Α, Τ, C }\n\n"
      ++ "  i) O δειγματικός χώρος Ω είναι η ένωση των καρτεσιανών γινομένων\n     Ω1 = ω1 x ω2 => "
      ++ formatSampleSpace tupleFormatter "Ω1" _W1
      ++ " και \n     Ω2 = ω3 x ω4 => "
      ++ formatSampleSpace tupleFormatter "Ω2" _W2
      ++ "\n     Οπότε Ω = Ω1 ∪ Ω2 =>\n     "
      ++ formatSampleSpace tupleFormatter "Ω" _W
      ++ "\n\n ii) Για το ενδεχόμενο Α ⊆ Ω, ισχύει Α = {(x,y) ∈ Ω | y = Α}. Οπότε:"
      ++ "\n    "
      ++ formatSampleSpace tupleFormatter "A" _A
