module XrcsA6 (exercise_6) where

import Data.Algebra.Helpers

exercise_6 :: IO ()
exercise_6 = do
  -- \| ΕΚΦΩΝΗΣΗ
  prepareText $
    "6. Σε καθεμιά από τις παρακάτω περιπτώσεις να εξετάσετε αν τα ενδεχόμενα Α και Β\
    \είναι ασυμβίβαστα:\n\
    \  i) Ρίχνουμε ένα ζάρι. Α είναι το ενδεχόμενο να φέρουμε 3 και Β είναι το ενδεχόμενο να φέρουμε άρτιο αριθμό.\n\
    \ ii) Επιλέγουμε ένα άτομο. Α είναι το ενδεχόμενο να έχει γεννηθεί στην Ελλάδα και \
    \Β το ενδεχόμενο να είναι καθολικός.\n\
    \iii) Επιλέγουμε μια γυναίκα. Α είναι το ενδεχόμενο να έχει ηλικία άνω των 30 και Β \
    \το ενδεχόμενο να είναι παντρεμένη πάνω από 30 χρόνια.\n\
    \ iv) Επιλέγουμε κάποιον με ένα αυτοκίνητο. Α είναι το ενδεχόμενο το αυτοκίνητό \
    \του να είναι ευρωπαϊκό και Β το ενδεχόμενο να είναι ασιατικό."

  -- \| ΔΕΔΟΜΕΝΑ

  --
  -- \| ΛΥΣΗ
  prepareText $
    "\nΛΥΣΗ\n----\n\
    \ O δειγματικός χώρος είναι Ω = { 1, 2, 3, 4, 5, 6}\n\
    \   i) Για τα ενδεχόμενα A = { 3 } και Β = { 2, 4, 6 } ισχύει Α ∩ B = ∅, οπότε είναι ασυμβίβαστα.\n\n\
    \  ii) Για το ενδεχόμενο Α = { Έλληνες } και Β = { Καθολικός } ισχύει Α ∩ B ≠ ∅, οπότε δεν είναι ασυμβίβαστα.\n\n\
    \ iii) Για το ενδεχόμενο Α = { Γυναίκες_ανω_των_30}  και Β = { Παντρεμένες_περισσότερο_από_30_χρονια} ισχύει Α ∩ B ≠ ∅, οπότε δεν είναι ασυμβίβαστα.\n\n\
    \  iv) Για το ενδεχόμενο A = {Ασιατικά_αυτοκίνητα} και Β = { Ευρωπαικά_αυτοκίνητα } ισχύει  Α ∩ B = ∅, οπότε είναι ασυμβίβαστα.\n"
