module XrcsA7 (exercise_7) where

import Data.Algebra.Helpers

exercise_7 :: IO ()
exercise_7 = do
  -- \| ΕΚΦΩΝΗΣΗ
  prepareText $
    "7. Μεταξύ των οικογενειών με τρία παιδιά επιλέγουμε τυχαία μια οικογένεια και εξετάζουμε τα παιδιά ως προς το φύλο και ως προς τη σειρά γέννησής τους. Να γράψετε το δειγματικό χώρο του πειράματος."

  -- \| ΔΕΔΟΜΕΝΑ

  let _W1 = ['Α', 'Κ'] :: [Char]
  let _W = [(x, y, z) | x <- _W1, y <- _W1, z <- _W1]

  --
  -- \| ΛΥΣΗ
  prepareText $
    "\nΛΥΣΗ\n----\n\
    \ O δειγματικός χώρος είναι ω1 = { Α, Κ } για το πρώτο παιδί, ω2 = ω1 για το 2ο και ω3 = ω1 για το 3ο. Οπότε Ω = {(x, y, z) ∣ x,y,z ∈ {A,K}³}: \n "
      ++ formatSampleSpace tripleFormatter "Ω" _W
